SecurityEvent
| where EventSourceName == "Microsoft-Windows-Sysmon" | where EventID == 13
| extend EVD = parse_xml(EventData)
| extend EventDetail = EVD.EventData.Data
| extend RuleName = EventDetail.[0].["#text"],
EventType = EventDetail.[1].["#text"],
UtcTime = EventDetail.[2].["#text"],
ProcessGuid = EventDetail.[3].["#text"],
ProcessId = EventDetail.[4].["#text"],
Image = EventDetail.[5].["#text"],
TargetObject = EventDetail.[6].["#text"],
Details = EventDetail.[7].["#text"],
User = EventDetail.[8].["#text"]
| project TimeCollected,Computer,EventID,EventType,tostring(RuleName),tostring(UtcTime),tostring(ProcessGuid),tostring(ProcessId),tostring(Image),tostring(TargetObject),tostring(Details),tostring(User)