SecurityEvent
| where EventSourceName == "Microsoft-Windows-Sysmon" | where EventID == 15
| extend EVD = parse_xml(EventData)
| extend EventDetail = EVD.EventData.Data
| extend EventType = "File Create Stream Hash"
| extend RuleName = EventDetail.[0].["#text"],
UtcTime = EventDetail.[1].["#text"],
ProcessGuid = EventDetail.[2].["#text"],
ProcessId = EventDetail.[3].["#text"],
Image = EventDetail.[4].["#text"],
TargetFilename = EventDetail.[5].["#text"],
CreationUtcTime = EventDetail.[6].["#text"],
Hash = EventDetail.[7].["#text"],
Contents = EventDetail.[8].["#text"],
User = EventDetail.[9].["#text"]
| project TimeCollected,Computer,EventID,EventType,tostring(RuleName),tostring(UtcTime),tostring(ProcessGuid),tostring(ProcessId),tostring(Image),tostring(TargetFilename),tostring(CreationUtcTime),tostring(Hash),tostring(Contents),
tostring(User)