SecurityEvent
| where EventSourceName == "Microsoft-Windows-Sysmon" | where EventID == 25
| extend EVD = parse_xml(EventData)
| extend EventDetail = EVD.EventData.Data
| extend EventType = "Process Tampering"
| extend RuleName = EventDetail.[0].["#text"],
UtcTime = EventDetail.[1].["#text"],
ProcessGuid = EventDetail.[2].["#text"],
ProcessId = EventDetail.[3].["#text"],
Image = EventDetail.[4].["#text"],
Type = EventDetail.[5].["#text"],
User = EventDetail.[6].["#text"]
| project TimeGenerated,Computer,EventID,tostring(RuleName),tostring(EventType),tostring(UtcTime),tostring(ProcessGuid),tostring(ProcessId),tostring(Image),tostring(Type),tostring(User)